Repository: ikostas/lmtk
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: Total source folder size is:
de: Gesamtgröße des Quellordners:

source: Quit
de: Beenden

source: View report
de: Bericht anzeigen

source: Novice Mode
de: Anfängermodus

source: Expert Mode
de: Expertenmodus

source: 0. Intro
de: 0. Einführung

source: 1. Gather Info
de: 1. Informationen sammeln

source: 3. Prepare Media
de: 3. Installationsmedien vorbereiten

source: No folder selected
de: Kein Ordner ausgewählt

source: Your current destination folder:
de: Ihr aktueller Zielordner:

source: Remove
de: Entfernen

source: No source folders selected
de: Keine Quellordner ausgewählt

source: No destination folder selected
de: Kein Zielordner ausgewählt

source: Destination is one of the input folders
de: Ziel ist einer der Eingabeordner

source: One input folder is a subfolder of another input folder
de: Ein Eingabeordner ist ein Unterordner eines anderen Eingabeordners

source: Output is inside one of the input folders (cyclic backup)
de: Ausgabe befindet sich in einem der Eingabeordner (zyklische Backup)

source: Skipping
de: Übersprungen

source: Backup complete, see log file for details
de: Backup abgeschlossen, Details finden Sie in der Protokolldatei

source: About
de: Über die App

source: Linux Migration Toolkit Copyright (C) 2025 Konstantin Ovchinnikov k@kovchinnikov.info This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. You should have received a copy of the GNU General Public License along with this program. If not, see https://www.gnu.org/licenses/. Source code: https://github.com/ikostas/lmtk
de: Linux Migration Toolkit Copyright (C) 2025 Konstantin Ovchinnikov k@kovchinnikov.info Dieses Programm ist freie Software: Sie können es unter den Bedingungen der GNU General Public License, wie von der Free Software Foundation veröffentlicht, weiterverbreiten und/oder modifizieren – entweder gemäß Version 3 der Lizenz oder (nach Ihrer Wahl) jeder späteren Version. Dieses Programm wird in der Hoffnung verbreitet, dass es nützlich sein wird, aber OHNE JEGLICHE GEWÄHRLEISTUNG – ohne sogar die implizite Gewährleistung der MARKTGÄNGIGKEIT oder EIGNUNG FÜR EINEN BESTIMMTEN ZWECK. Weitere Details finden Sie in der GNU General Public License. Sie sollten eine Kopie der GNU General Public License zusammen mit diesem Programm erhalten haben. Falls nicht, siehe https://www.gnu.org/licenses/. Quellcode: https://github.com/ikostas/lmtk

source: Let's prepare your installation media
de: Bereiten wir Ihre Installationsmedien vor

source: Here's what you should do next: 1. Download linux ISO and media writer 2. Launch media writer, write ISO to a USB-stick 3. Reboot, enter BIOS/UEFI, set USB-stick as a first boot device and turn off Secure Boot option I'd recommend the following options for media writers: - balenaEtcher - Rufus - UNetbootin There's a thorough guide for using Rufus with Ubuntu: - Ubuntu Wiki
de: Hier ist, was Sie als Nächstes tun sollten: 1. Linux-ISO und Media Writer herunterladen 2. Media Writer starten, ISO auf einen USB-Stick schreiben 3. Neustarten, BIOS/UEFI aufrufen, USB-Stick als erstes Boot-Gerät festlegen und die Option 'Secure Boot' deaktivieren Ich würde die folgenden Optionen für Media Writer empfehlen: - balenaEtcher - Rufus - UNetbootin Es gibt eine ausführliche Anleitung zur Verwendung von Rufus mit Ubuntu: - Ubuntu Wiki

source: You know the drill: write your ISO to a USB stick and boot into a Linux installation. Here are some media writer options: - balenaEtcher, Rufus, UNetbootin as standard options - Ventroy to experiment with several ISOs Have fun!
de: Sie wissen, was zu tun ist: Schreiben Sie Ihr ISO auf einen USB-Stick und starten Sie eine Linux-Installation. Hier sind einige Optionen für Media Writer: - balenaEtcher, Rufus, UNetbootin als Standardoptionen - Ventroy zum Experimentieren mit mehreren ISOs Viel Spaß!

source: Back
de: Zurück

source: Home
de: Startseite

source: Let's back up your data
de: Lassen Sie uns ein Backup Ihrer Daten erstellen

source: Some tips: 1. Use an external drive with enough free space as the destination. 2. You must have read access (as a Windows user) to all folders you want to back up. 3. I've included some default folders, but it's your responsibility to add all folders that contain valuable data. Bonus tip: All your data in Windows will be erased after installing Linux. :) So make sure you select all source folders with important data.
de: Einige Tipps: 1. Verwenden Sie eine externe Festplatte mit ausreichend freiem Speicherplatz als Ziel. 2. Sie müssen (als Windows-Benutzer) Lesezugriff auf alle Ordner haben, die Sie sichern möchten. 3. Ich habe einige Standardordner hinzugefügt, aber es liegt in Ihrer Verantwortung, alle Ordner mit wichtigen Daten hinzuzufügen. Bonus-Tipp: Alle Ihre Daten in Windows werden nach der Installation von Linux gelöscht. :) Stellen Sie also sicher, dass Sie alle Quellordner mit wichtigen Daten auswählen.

source: Choose your folders to back up, and I'll create an archive in destination folder.
de: Wählen Sie Ihre Ordner aus, und ich erstelle ein Archiv im Zielordner.

source: Enable compression
de: Komprimierung aktivieren

source: Set destination
de: Ziel festlegen

source: Here you set the folder, where to put your archive
de: Hier legen Sie den Ordner fest, in dem Ihr Archiv abgelegt werden soll

source: Add source folder
de: Quellordner hinzufügen

source: Here you can add folders to the archive
de: Hier können Sie Ordner zum Archiv hinzufügen

source: Your source folders for backup - press 'Remove' to remove from the list.
de: Ihre Quellordner für die Sicherung - drücken Sie 'Entfernen', um sie aus der Liste zu entfernen.

source: Perform backup
de: Backup durchführen

source: Next
de: Weiter

source: Gathering software and hardware info
de: Sammeln von Software- und Hardware-Informationen

source: Let's gather some info about your hardware and software
de: Sammeln wir Informationen über Ihre Hardware und Software

source: This is a very important step: we save information about your hardware configuration and installed software as HTML and Markdown for future use. Press 'View report' when it's ready — the report includes instructions and some useful links as well.
de: Dies ist ein sehr wichtiger Schritt: Wir speichern Informationen über Ihre Hardwarekonfiguration und installierte Software als HTML und Markdown für die zukünftige Verwendung. Drücken Sie 'Bericht anzeigen', wenn er fertig ist – der Bericht enthält auch Anweisungen und einige nützliche Links.

source: Press 'View report' when it's ready — the report includes the collected information, instructions, and some useful links. A Markdown version is also included.
de: Drücken Sie 'Bericht anzeigen', wenn er fertig ist – der Bericht enthält die gesammelten Informationen, Anweisungen und einige nützliche Links. Eine Markdown-Version ist ebenfalls enthalten.

source: Now we are gathering software and hardware info
de: Wir sammeln jetzt Software- und Hardware-Informationen

source: Finished gathering software and hardware info
de: Sammeln von Software- und Hardware-Informationen abgeschlossen

source: Are you familiar with Linux?
de: Sind Sie mit Linux vertraut?

source: So, you're going to install Linux. But are you familiar with Linux? If not, there are some resources to help you master it without too much risk: - Git for Windows -- includes bash and core command-line utilities, as well as vim text editor. - VirtualBox -- you'll be able to install and play with any Linux distribution you like in a sandbox. - LiveCD -- you'll be able to boot into Linux and at least check if your hardware works. The most common question is 'What distribution should I use?' Well, I'd recommend Ubuntu or Fedora to have a pleasant start. The next question is 'What desktop environment should I use?' I'd recommend Gnome if you have enough memory or XFCE, if you don't. :) Here are some links (all of them include LiveCDs, by the way): - Fedora (Gnome-based) - Fedora XFCE - Ubuntu (Gnome-based) - Ubuntu XFCE When you click 'Next', we'll gather information about your software and hardware, save it as Markdown (.md) and HTML (.html) reports for future use.
de: Sie werden also Linux installieren. Aber sind Sie mit Linux vertraut? Falls nicht, gibt es einige Ressourcen, die Ihnen helfen, es ohne zu großes Risiko zu meistern: - Git for Windows -- enthält Bash und grundlegende Befehlszeilen-Dienstprogramme sowie den Vim-Texteditor. - VirtualBox -- Sie können jede gewünschte Linux-Distribution in einer Sandbox installieren und ausprobieren. - LiveCD -- Sie können Linux booten und zumindest überprüfen, ob Ihre Hardware funktioniert. Die häufigste Frage ist: 'Welche Distribution soll ich verwenden?' Nun, ich würde Ubuntu oder Fedora für einen angenehmen Start empfehlen. Die nächste Frage ist: 'Welche Desktop-Umgebung soll ich verwenden?' Ich würde Gnome empfehlen, wenn Sie genügend Arbeitsspeicher haben, oder XFCE, wenn nicht. :) Hier sind einige Links (alle enthalten übrigens LiveCDs): - Fedora (Gnome-basiert) - Fedora XFCE - Ubuntu (Gnome-basiert) - Ubuntu XFCE Wenn Sie auf 'Weiter' klicken, sammeln wir Informationen über Ihre Software und Hardware und speichern diese als Markdown (.md) und HTML (.html) Berichte für die zukünftige Verwendung.

source: LMTK: Welcome to Linux Migration Toolkit!
de: LMTK: Willkommen beim Linux Migration Toolkit!

source: Welcome to Linux Migration Toolkit! Choose Your Mode
de: Willkommen beim Linux Migration Toolkit! Wählen Sie Ihren Modus

source: Welcome to the Linux Migration Toolkit for the desktop! This app gathers information about your installed programs and hardware for future use, helps you back up your data, and assists in preparing installation media using external tools.
de: Willkommen beim Linux Migration Toolkit für den Desktop! Diese App sammelt Informationen über Ihre installierten Programme und Hardware für die zukünftige Verwendung, hilft Ihnen beim Sichern Ihrer Daten und unterstützt Sie bei der Vorbereitung von Installationsmedien mit externen Tools.

source: For each step you'll have useful guidance and links. Also use it if you use this program for the first time.
de: Für jeden Schritt erhalten Sie nützliche Anleitungen und Links. Verwenden Sie es auch, wenn Sie dieses Programm zum ersten Mal verwenden.

source: You know what the program does.
de: Sie wissen, was das Programm tut.

source: PowerShell is installed. We'll need it to do some stuff.
de: PowerShell ist installiert. Wir werden es für einige Dinge benötigen.

source: PowerShell is not installed. Please install it and restart the app.
de: PowerShell ist nicht installiert. Bitte installieren Sie es und starten Sie die App neu.

source: This project is licensed under the GNU General Public License v3.0 or later. Press 'About' for more details.
de: Dieses Projekt ist unter der GNU General Public License Version 3.0 oder neuer lizenziert.Wählen Sie „Über die App“ für weitere Details.

source: Thanks to all the guys and gals in reddit.com/r/linuxsucks/, you're my inspiration.
de: Vielen Dank an alle Jungs und Mädels auf reddit.com/r/linuxsucks/, ihr seid meine Inspiration.

source: Linux Migration Toolkit Report
de: Linux Migration Toolkit Bericht

source: Standard Applications
de: Standardanwendungen

source: Microsoft Store Applications
de: Microsoft Store Anwendungen

source: Hardware Information
de: Hardware-Informationen

source: Generated on
de: Generiert am

source: What do I do with this information?
de: Was mache ich mit diesen Informationen?

source: You can use this report to
de: Sie können diesen Bericht verwenden, um

source: Check your hardware's compatibility with Linux
de: Die Kompatibilität Ihrer Hardware mit Linux überprüfen

source: Find Linux alternatives for the Windows programs you currently use
de: Linux-Alternativen für die derzeit verwendeten Windows-Programme finden

source: Helpful resources
de: Hilfreiche Ressourcen

source: Linux software equivalents to Windows software
de: Linux-Software-Äquivalente zu Windows-Software

source: Table of Contents
de: Inhaltsverzeichnis

source: these apps are installed, when you download and installation file and launch it
de: Diese Apps werden installiert, wenn Sie eine Installationsdatei herunterladen und ausführen.

source: these are the apps, installed from Microsoft Store
de: Dies sind die Apps, die aus dem Microsoft Store installiert wurden.

source: some basic information about your system
de: Einige grundlegende Informationen über Ihr System

source: Error deleting
de: Fehler beim Löschen

source: Number of Cores
de: Anzahl der Kerne

source: Drives
de: Festplatten

source: Size
de: Größe

source: Free
de: Frei

source: Connection ID
de: Verbindungs-ID

source: Type
de: Typ

source: Printers
de: Drucker

source: Port
de: Anschluss

source: Scanners
de: Scanner

source: No devices found
de: Keine Geräte gefunden
